[
    {
        "term": "CSS",
        "definition": "Cascading Style Sheets"
    },
    {
        "term": "JS",
        "definition": "JavaScript"
    },
    {
        "term": "PHP",
        "definition": "PHP: Hypertext preprocessor"
    },
    {
        "term": "OOP",
        "definition": "Object oriented programming"
    },
    {
        "term": "SAO",
        "definition": "Sword Art Online"
    },
    {
        "term": "NHK",
        "definition": "NHK, Nippon Hoso Kyokai (Japan Broadcasting Corporation), is Japan's only public broadcaster."
    },
    {
        "term": "SOLID",
        "definition": "S - Single-responsibility principle O - Open-closed principle L - Liskov substitution principle I - Interface segregation principle D - Dependency Inversion Principle"
    },
    {
        "term": "Ecchi",
        "definition": "Ecchi is another way to say &#34;perverted&#34; in Japanese, but its connotation is not as strong as hentai. Anime that contain a lot of sexual humor but no outright pornography are often referred to as ecchi, examples include Love Hina and to a lesser extent Ranma 1\/2."
    },
    {
        "term": "Jebaited",
        "definition": "Jebaited is a Twitch.tv emote featuring the face of organizer of Community Effort Orlando, Alex Jebailey.\r\nIt is typically used when a streamer is tricked or believes their chat when they say something completely incorrect."
    },
    {
        "term": "Otaku",
        "definition": "Otaku (Japanese: おたく, オタク, or ヲタク) is a Japanese word that describes people with consuming interests, particularly in anime, manga, video games, or computers. Its contemporary use originated with a 1983 essay by Akio Nakamori in Manga Burikko. Otaku may be used as a pejorative with its negativity stemming from a stereotypical view of otaku as social outcasts and the media&#39;s reporting on Tsutomu Miyazaki, &#34;The Otaku Murderer&#34;, in 1989. According to studies published in 2013, the term has become less negative, and an increasing number of people now identify themselves as otaku,[1] both in Japan and elsewhere. Out of 137,734 teens surveyed in Japan in 2013, 42.2% self-identified as a type of otaku."
    }
]